app/controllers/phase1_controller.rb

    def phase1

    	    @fetch=Pstaff.all
---
SELECT `pstaffs`.* FROM `pstaffs`