app/controllers/pstaffs_controller.rb

  def create
    @pstaff = current_user.pstaffs.build(pstaff_params)

    respond_to do |format|
      if @pstaff.save
---
INSERT INTO `pstaffs` (`name`, `gender`, `mobile_no`, `department`, `address`, `vehical_type`, `created_at`, `updated_at`, `user_id`) VALUES ('prakash', 'sharma', '', '', '', '', '2019-05-12 07:20:08', '2019-05-12 07:20:08', 1)

  def destroy
    @pstaff.destroy
---
DELETE FROM `pstaffs` WHERE `pstaffs`.`id` = 1

    def set_pstaff
      @pstaff = Pstaff.find(params[:id])
---
SELECT  `pstaffs`.* FROM `pstaffs` WHERE `pstaffs`.`id` = 0 LIMIT 1